app/controllers/admin/grades_controller.rb

SELECT "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @grade = Grade.find(params[:id])

INSERT INTO "grades" ("address", "created_at", "description", "geocode", "gyear", "name", "status", "stype", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @grade = Grade.new(params[:grade])

    respond_to do |format|
      if @grade.save

SELECT "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "grades" SET "name" = '2015级qweewq', "description" = 'qwe', "updated_at" = '2012-09-03 10:16:29.829500' WHERE "grades"."id" = 3
---
  def update
    @grade = Grade.find(params[:id])

    respond_to do |format|
      if @grade.update_attributes(params[:grade])

SELECT "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "grades" WHERE "grades"."id" = ?  [["id", 4]]
---
  def destroy
    @grade = Grade.find(params[:id])
    @grade.destroy