app/controllers/admin/sclasses_controller.rb

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @sclass   = Sclass.find(params[:id])

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @sclass = Sclass.find(params[:id])

INSERT INTO "sclasses" ("address", "created_at", "ctype", "description", "grade_id", "name", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @sclass = Sclass.new(params[:sclass])

    respond_to do |format|
      if @sclass.save

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "sclasses" SET "name" = '201403班', "updated_at" = '2012-09-04 06:18:50.248878' WHERE "sclasses"."id" = 1
---
  def update
    @sclass = Sclass.find(params[:id])

    respond_to do |format|
      if @sclass.update_attributes(params[:sclass])

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT 1 FROM "users" WHERE (LOWER("users"."login") = LOWER('YCS14C01') AND "users"."id" != 23) LIMIT 1
INSERT INTO "users" ("activated_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "deleted_at", "email", "encrypted_password", "identity_url", "language", "last_sign_in_at", "last_sign_in_ip", "login", "name", "remember_created_at", "remember_token", "reset_password_token", "sign_in_count", "sname", "state", "twitter_token", "unumber", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "login" = 'YCS14C01', "name" = '包不同', "encrypted_password" = '$2a$10$8X4Mt5A8EssWE0ajwh4Xv.XCQnonVW.gLHzIeFVS0vITPNidepl0a', "language" = 'cn', "email" = 'YCS14C01@yucai.cn', "created_at" = '2012-09-10 09:50:08.775402', "updated_at" = '2012-09-10 09:50:08.775402', "state" = 'active' WHERE "users"."id" = 23
---
  def add_student
    @sclass= Sclass.find(params[:id])

    @student = User.find_by_login(params[:user][:login])
    if @student.nil?
      params[:user][:password]="hello123"
      params[:user][:password_confirmation]="hello123"
      params[:user][:language]="cn"
      params[:user][:email]=params[:user][:login]+"@yucai.cn"

      @student = User.new(params[:user])
    end

    respond_to do |format|
      if @student.save

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT 1 FROM "users" WHERE (LOWER("users"."login") = LOWER('yanjh') AND "users"."id" != 4) LIMIT 1
---
  def add_teacher
    @sclass= Sclass.find(params[:id])

    @teacher = User.find_by_login(params[:user][:login])