app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."name" = 'admin' LIMIT 1
SELECT 1 FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 4 AND "roles"."id" = 1 LIMIT 1
---
  def toggle_role
    @user = User.find(params[:id])
    role = Role.find_by_name(params[:role])
    if @user.roles.include?(role)

SELECT "users".* FROM "users" WHERE (login LIKE '%yanjh%' OR email LIKE '%yanjh%') LIMIT 100 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (login LIKE '%yanjh%' OR email LIKE '%yanjh%')
---
  def search
    # Basic Search with pagination
    @users = User.search(params[:search], params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def reset_password
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."state" = 'pending' LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE "users"."state" = 'pending'
---
  def pending
    @users = User.paginate :conditions => {:state => 'pending'}, :page => params[:page]

SELECT "users".* FROM "users" WHERE "users"."state" = 'suspended' LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE "users"."state" = 'suspended'
---
  def suspended
    @users = User.paginate :conditions => {:state => 'suspended'}, :page => params[:page]

SELECT "users".* FROM "users" WHERE "users"."state" = 'active' LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE "users"."state" = 'active'
---
  def active
    @users = User.paginate :conditions => {:state => 'active'}, :page => params[:page]

SELECT "users".* FROM "users" WHERE "users"."state" = 'deleted' LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE "users"."state" = 'deleted'
---
  def deleted
    @users = User.paginate :conditions => {:state => 'deleted'}, :page => params[:page]

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "deleted_at" = '2012-08-30 05:42:37.288974', "state" = 'deleted', "updated_at" = '2012-08-30 05:42:37.334837' WHERE "users"."id" = 4
---
  def destroy
    @user = User.find(params[:id])
    @user.delete!

SELECT "users".* FROM "users" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("activated_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "deleted_at", "email", "encrypted_password", "identity_url", "language", "last_sign_in_at", "last_sign_in_ip", "login", "name", "remember_created_at", "remember_token", "reset_password_token", "sign_in_count", "sname", "state", "twitter_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
   # debugger
    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "encrypted_password" = '$2a$10$TY8hk5o6uGdf/sr/oMnVQeKIinbWQZUbvEJVGjEzw.8etiVHkCit6', "language" = 'en', "updated_at" = '2012-08-30 05:43:34.628580' WHERE "users"."id" = 4
---
  def update
    @user = User.find(params[:id])
    @user.attributes = params[:user]

    respond_to do |format|
      if @user.save