app/controllers/cexams_controller.rb

  def edit
    @cexam   = Cexam.find(params[:id])
---
SELECT "cexams".* FROM "cexams" WHERE "cexams"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @cexam = Cexam.new(params[:cexam])

    respond_to do |format|
      if @cexam.save
---
INSERT INTO "cexams" ("chapter_id", "created_at", "description", "etype", "name", "score", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @cexam = Cexam.find(params[:id])
    respond_to do |format|
      if params[:by]=="add_problem"
        problem=Problem.find_by_pcode(params[:problem])
        if problem
          Question.create(:problem_id=>problem.id,:pcode=>problem.pcode,:cexam_id=>@cexam.id,:qorder=>1,:score=>10)
          format.html { redirect_to edit_cexam_path(@cexam), notice: t('operate.add_success') }
          #format.json { head :ok }
        else
          format.html { redirect_to edit_cexam_path(@cexam), notice: t('operate.add_false') }
        end
      elsif params[:by]=="add_question"
        problem = Problem.new(params[:problem])
        problem.owner=current_user.id
        if problem.save
          Question.create(:problem_id=>problem.id,:pcode=>problem.pcode,:cexam_id=>@cexam.id,:qorder=>1,:score=>10)
          format.html { redirect_to edit_cexam_path(@cexam), notice: t('operate.add_success') }
          #format.json { head :ok }
        else
          format.html { redirect_to edit_cexam_path(@cexam), notice: t('operate.add_false') }
        end
      elsif params[:by]=="update_problem"
        problem = Problem.find(params[:problem_id])
---
SELECT "cexams".* FROM "cexams" WHERE "cexams"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "problems".* FROM "problems" WHERE "problems"."pcode" = 'B00002' LIMIT 1
INSERT INTO "problems" ("answer", "content", "created_at", "ctype", "description", "level", "owner", "pcode", "ptype", "status", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "questions" ("cexam_id", "created_at", "pcode", "problem_id", "ptype", "qorder", "score", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "cexams" SET "name" = '小节测验-全等三角形', "updated_at" = '2012-09-11 18:37:04.593310' WHERE "cexams"."id" = 2
UPDATE "problems" SET "status" = 0, "title" = '所有等边三角形皆为全等三角形', "content" = '', "answer" = 'B', "updated_at" = '2012-09-11 18:31:22.364687' WHERE "problems"."id" = 5
UPDATE "questions" SET "ptype" = 0 WHERE (problem_id=4)
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "3"]]