app/controllers/cexams_controller.rb

  def edit
    @course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "3"]]

  def update
    @course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 6 LIMIT 1