app/controllers/chapters_controller.rb

INSERT INTO "chapters" ("cid", "content", "corder", "course_id", "cpcode", "created_at", "description", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @chapter = Chapter.new(params[:chapter])
    @course=@chapter.course
    respond_to do |format|
      if @chapter.save

SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @chapter = Chapter.find(params[:id])

SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "chapters" SET "cpcode" = 'C11-02', "content" = '', "updated_at" = '2012-09-10 08:11:36.157884' WHERE "chapters"."id" = 3
---
  def update
    @chapter = Chapter.find(params[:id])

    respond_to do |format|
      if params[:by]=="add_class"
        sclass=Sclass.find(params[:sclass])
        if sclass
          @chapter.add_class(sclass)
          format.html { redirect_to @chapter.course, notice: t('operate.add_success') }
          #format.json { head :ok }
        else
          format.html { redirect_to @chapter.course, notice: t('operate.add_false') }
        end
      else
        if @chapter.update_attributes(params[:chapter])

SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "chapters" WHERE "chapters"."id" = ?  [["id", 9]]
---
  def destroy
    @chapter = Chapter.find(params[:id])
    respond_to do |format|
      if params[:by]=="remove_class"
        sclass=Sclass.find(params[:sclass])
        if sclass
          @chapter.remove_class(sclass)
          format.html { redirect_to @chapter.course, notice: t('operate.remove_success') }
          #format.json { head :ok }
        else
          format.html { redirect_to @chapter.course, notice: t('operate.remove_false') }
        end
      else
        @course=@chapter.course
        @chapter.destroy