app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "9"]]
---
  def show
    @course  = Course.find(params[:id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "9"]]
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO "courses" ("ccode", "content", "created_at", "ctype", "description", "end_at", "start_at", "state", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "users".* FROM "users" WHERE "users"."login" = 'YCTB03' LIMIT 1
SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."name" = '2014A班' LIMIT 1
UPDATE "courses" SET "ccode" = 'E09A', "title" = '初三英语(上)', "updated_at" = '2012-09-08 04:27:27.360123' WHERE "courses"."id" = 9
---
  def update
    @course = Course.find(params[:id])
    respond_to do |format|
      if params[:by]=="add_teacher"
        teacher=User.find_by_login(params[:teacher])
        if teacher && (teacher.id!=current_user.id)
          @course.add_user(teacher,1)
          format.html { redirect_to course_url, notice: t('operate.add_success') }
          #format.json { head :ok }
        else
          format.html { redirect_to course_url, notice: t('operate.add_false') }
        end
      elsif params[:by]=="add_class"
        sclass=Sclass.find_by_name(params[:sclass])
        if sclass
          @course.add_class(sclass)
          format.html { redirect_to course_url, notice: t('operate.add_success') }
          #format.json { head :ok }
        else
          format.html { redirect_to course_url, notice: t('operate.add_false') }
        end
      else
        if @course.update_attributes(params[:course])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 9]]
---
  def destroy
    @course = Course.find(params[:id])

    respond_to do |format|
      if params[:by]=="remove_teacher"
        teacher=User.find(params[:teacher])
        @course.remove_user(teacher)
        format.html { redirect_to @course }
        format.json { head :ok }
      elsif params[:by]=="remove_class"
        sclass=Sclass.find(params[:sclass])
        @course.remove_class(sclass)
        format.html { redirect_to @course }
        format.json { head :ok }
      else
        @course.delete_users