app/controllers/problems_controller.rb

  def create
    @problem = Problem.new(params[:problem])

    respond_to do |format|
      if @problem.save
        if params[:cexam_id]
          cexam_id=params[:cexam_id]
          @question=Question.create(:problem_id=>@problem.id,:pcode=>@problem.pcode,:cexam_id=>cexam_id,:qorder=>@problem.id)
---
INSERT INTO "problems" ("answer", "content", "created_at", "ctype", "level", "owner", "pcode", "ptype", "status", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "questions" ("cexam_id", "created_at", "pcode", "problem_id", "ptype", "qorder", "score", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)