app/controllers/questions_controller.rb

  def edit
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "2"]]

  def update
    @question = Question.find(params[:id])

    respond_to do |format|

      if @question.update_attributes(params[:question])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "questions" SET "score" = 10, "qorder" = 1, "updated_at" = '2012-09-11 16:10:20.892460' WHERE "questions"."id" = 3

  def destroy
    @question = Question.find(params[:id])
    respond_to do |format|
      @cexam  =@question.cexam
      @question.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 2]]