app/controllers/sclasses_controller.rb

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "18"]]
---
  def show
    @sclass   = Sclass.find(params[:id])

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "2"]]
---
  def update
    @sclass = Sclass.find(params[:id])