app/controllers/scourses_controller.rb

  def index
    @sclass  = Sclass.find(current_user.sclass.sclass_id)
---
SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", 2]]

  def show
    if (params[:by]=="chapter")
      @scourse  = Mlink.one(params[:id],current_user.id,Mlink::T_CHAPTER_USER )
    elsif (params[:by]=="cexam")
      @scourse  = Mlink.one(params[:id],current_user.id,Mlink::T_CEXAM_USER )
    else
      @scourse  = Mlink.find(params[:id])
    end

    respond_to do |format|
      if @scourse.ltype==Mlink::T_CHAPTER_USER
        @chapter = Chapter.find(@scourse.id1)
        @title = t("chapter.title")
      else
        @title = t("exam.title")
        @cexam = Cexam.find(@scourse.id1)
---
SELECT "mlinks".* FROM "mlinks" WHERE (id1='1' and id2=8 and ltype=10) LIMIT 1
SELECT "mlinks".* FROM "mlinks" WHERE "mlinks"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", 2]]
SELECT "cexams".* FROM "cexams" WHERE "cexams"."id" = ? LIMIT 1  [["id", 1]]

  def create
    respond_to do |format|
      if (params[:by]=="chapter")
        chapter = Chapter.find(params[:id])
        if @scourse = Mlink.create(:id1=>chapter.id,:name1=>chapter.title,:order1=>chapter.cpcode,:id2=>current_user.id,:name2=>current_user.name,:order2=>current_user.login,:ltype=>Mlink::T_CHAPTER_USER,:status=>1)
          format.html { redirect_to scourse_url(@scourse), notice: t('operate.create_success')}
          #format.json { render json: @grade, status: :created, location: @grade }
        else
          #format.html { render action: "new" }
          #format.json { render json: @grade.errors, status: :unprocessable_entity }
        end
      elsif (params[:by]=="cexam")
        cexam = Cexam.find(params[:id])
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "mlinks" ("created_at", "id1", "id2", "ltype", "name1", "name2", "order1", "order2", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cexams".* FROM "cexams" WHERE "cexams"."id" = ? LIMIT 1  [["id", "1"]]