app/controllers/users_controller.rb

  def show
    @student = User.find(params[:id])
    @sclass  = Sclass.find(@student.sclass.sclass_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "11"]]
SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", 2]]

  def find_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]